{
  "authors": [
    {
      "author": "peter-sloan"
    }
  ],
  "showOnPodcast": false,
  "itunesImage": "/uploads/logo.jpg",
  "deck": "<p>I don’t have a tattoo. I’ve always liked the idea of having one (despite the idea of paying some to stick a needle in my skin seeming abhorrent!), but both my mother and wife have always been against me getting one.\n</p>\n<p>If I did have a tattoo it would be one word: עִמָּנוּאֵל the Hebrew for Immanuel \"God with us\". Hebrews begins with “The Son is the radiance of God’s glory and the exact representation of his being” (Hebrews 1:3). In the message it translates as Jesus being \"<i>stamped\"</i> with God’s nature. This concept has always been a marvel that has captivated me. The meaning of this is explored in our readings this week in the books of 1 Peter &amp; Hebrews.\n</p>\n<p>Whereas a tattoo is an outward mark, Peter in his first letter, challenges us to sort out what is inside. That we should purify ourselves and rid ourselves of all that holds us back from stepping into a full life, where we are called as chosen people to fulfil God’s mission – we are called priests.\n</p>\n<p>I’ve always struggled to see myself as a priest. It’s clouded with preconceptions with the religious function (in my head I imagine an old man with a pointy hat!). I’ve had to remind myself that a priest was someone chosen by God who would fulfil his purpose, most notably by offering sacrifices. But as the readings this week show us, that was fulfilled and completed through Jesus!\n</p>\n<p>What stood out to me in the readings in both books was how clear they were in what this role means for us today. Often I find people are critical of the Bible because it’s not practical. Yet we are told that the role of a priest now is to be witnesses of Jesus in word; “declare the praises of him who called you out of darkness into his wonderful light” (1 Peter 2:9) and deed; “to do good and to share with others” (Hebrews 13:16).\n</p>\n<p>In the book of Hebrews it was impossible for me to miss the many mentions of Melchizedek! He is a peculiar and unique person in the Bible. Not only was he the first priest, but also a king. Jesus “was designated by God to be high priest in the order of Melchizedek<strong>” </strong>(Hebrews 5:10). What a statement to make that he is both our high priest and king!\n</p>\n<p>In 1 Peter we are called out as priests. And Hebrews begins to unpack the incredible reality of who Jesus is. Yet Jesus is also described throughout Hebrews as being one of us; Jesus, <i>fully human in every way </i>(Hebrews 2:17). He knows us, he understands us, he is one of us. Wow! Immanuel, God with us, one of us!\n</p>\n<p>As I reflected over this during the week I pictured Jesus as my big brother. He leads the way, shows me what to do and how to do it.\n</p>\n<p>I might not have a physical tattoo, but I am marked, as are all of us that follow Jesus. We are marked as priests, we are marked as children of God, and as a family, we are all in this together. As the writer to the Hebrews reminds us in at the end of the letter, “Keep on loving one another as brothers and sisters. Do not forget to show hospitality to strangers.” (Hebrews 13:1-2). Let’s encourage each other, build one another up, help where we see a need, as our hearts are tattooed with Jesus, let’s make our hands and feet do his good work.\n</p>\n<p><span class=\"text\">The Holy Spirit confirms this:</span>\n</p>\n<p><span class=\"text\">This new plan I’m making with Israel</span><br> <span class=\"text\">isn’t going to be written on paper,</span><br> <span class=\"text\">isn’t going to be chiselled in stone;</span><br> <span class=\"text\">This time “I’m writing out the plan <i>in</i> them,</span><br> <span class=\"text\">carving it on the lining of their hearts.”                   </span>(Hebrews 10:15-16 MSG)\n</p>\n<p>You can <a href=\"https://drive.google.com/file/d/1Ua9y69ZMKbbRwmjvh6Y-ouPEVLCYHmDN/view?usp=sharing\" target=\"_blank\">download a copy of the Reading Plan here</a>.<br>\n</p>\n<p>Photo by <a href=\"https://unsplash.com/photos/nkIABAQDlxs?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Josh Applegate</a> on <a href=\"https://unsplash.com/search/photos/priest?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a><span class=\"redactor-invisible-space\"><br></span>\n</p>",
  "colour": "purple",
  "date": "2018-03-19T12:05:00+00:00",
  "subtitle": "From January 1st through to Easter Sunday, we're inviting the church to read through the books of the New Testament together, following a plan that takes us chronologically through the Scriptures. Each week, we've invited a different person to reflect on what God has been saying to them through the readings of that week. This week, Peter Sloan shares his observations on week eleven of our readings.",
  "title": "A priest with a tattoo!",
  "image": "/uploads/josh-applegate-301321-unsplash (Medium).jpg"
}