{
  "authors": [
    {
      "author": "christine-hobson"
    }
  ],
  "showOnPodcast": false,
  "itunesImage": "/uploads/logo.jpg",
  "deck": "<p>This week’s readings contained a passage that I looked at regularly whilst I was living in Asia. In fact, each year I challenged all those who were just beginning their year at the mission school I was involved with to keep it in mind as they settled into life in a very different culture.\n</p>\n<p><u></u>\n</p>\n<p>1 Corinthians 9:19-23 calls us to be willing to become like those to whom we want to preach the gospel...<u></u>\n</p>\n<p>“Though I am free and belong to no man,” Paul writes, “I make myself a slave to everyone, to win as many as possible. To the Jews I became like a Jew, to win the Jews. To those under the law I became like one under the law… to win those under the law. To those not having the law I became like one not having the law… to win those not having the law. To the weak I became weak, to win the weak. I have become all things to all men so that by all possible means I might save some. I do all this for the sake of the gospel.”<u></u><u></u>\n</p>\n<p>Living in Asia, it was very easy to see the application of that passage.<u></u><u></u>\n</p>\n<p>Our daily lives were taking place in a very different culture from the one we had grown up in. We were regularly offered food that wouldn’t normally appear on a British dinner table. People around us didn’t always do things the way we expected or wanted.<u></u><u></u>\n</p>\n<p>Yet we would eat what we were offered and make the effort to fit in with local customs, however strange and sometimes uncomfortable they might be, in order that we might have the opportunity to win people for Christ.<u></u><u></u>\n</p>\n<p>Now that I’m living back in my home culture, it’s easy to gloss over a Bible passage like this and assume it only applies to those called to live overseas as missionaries.<u></u><u></u>\n</p>\n<p>But one of God’s challenges to me this week was to apply this same passage to my situation here in my comfortable life in York.<u></u><u></u>\n</p>\n<p>How ready am I now to step out of my comfort zone, to “put up with anything rather than hinder the gospel of Christ” (1 Corinthians 9:12)?<u></u><u></u>\n</p>\n<p>What does it mean now to “become all things to all men” to win some for Christ (9:22)?<u></u><u></u>\n</p>\n<p>The answer will be different for each one of us.<u></u><u></u>\n</p>\n<p>For me that might mean something as simple as initiating a conversation with someone I don’t naturally relate to.<u></u><u></u>\n</p>\n<p>Or stopping my pressing tasks in order to listen to someone who is struggling and needs a listening ear.<u></u><u></u>\n</p>\n<p>Or taking part in an activity I might not normally choose in order to deepen a friendship.<u></u><u></u>\n</p>\n<p>Caleb’s sermon last Sunday focussed on living life now in the light of Jesus’ return. So it seemed very timely to start this week by reading about what “will happen when the Lord Jesus is revealed from heaven in blazing fire” (2 Thessalonians 1:7).<u></u><u></u>\n</p>\n<p>In that same letter, Paul reminds us of the amazing truth that when Jesus comes again, He will “be glorified in his holy people”. Just in case we haven’t quite caught hold of what that means, Paul continues: “This includes you” (1:10). God will be glorified in all those who have believed in him, including in you and in me!<u></u><u></u>\n</p>\n<p>Paul also tells us, “No eye has seen, no ear has heard, no mind has conceived what God has prepared for those who love him” (1 Corinthians 2:9).<u></u><u></u>\n</p>\n<p>If I keep those thoughts of eternity as my starting place, maybe that will help me find the strength and vision in this life to do things that I don’t find very comfortable in order to play my part in bringing some to the Lord.\n</p>\n<p>You can <a href=\"https://drive.google.com/file/d/1Ua9y69ZMKbbRwmjvh6Y-ouPEVLCYHmDN/view?usp=sharing\" target=\"_blank\">download a copy of the Reading Plan here</a>.<br>\n</p>\n<p>Photo by <a href=\"https://unsplash.com/photos/5BOQ692zJO4?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Aaron Burden</a> on <a href=\"https://unsplash.com/search/photos/bible?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a><span class=\"redactor-invisible-space\"><br></span>\n</p>",
  "colour": "purple",
  "date": "2018-02-19T12:30:00+00:00",
  "subtitle": "From January 1st through to Easter Sunday, we're inviting the church to read through the books of the New Testament together, following a plan that takes us chronologically through the Scriptures. Each week, we've invited a different person to reflect on what God has been saying to them through the readings of that week. This week, Christine Hobson shares her observations on the seventh week of readings.",
  "title": "All Things to All Men",
  "image": "/uploads/aaron-burden-282699 (Medium).jpg"
}