{
  "authors": [
    {
      "author": "jenny-herrera"
    }
  ],
  "showOnPodcast": false,
  "itunesImage": "/uploads/logo.jpg",
  "deck": "<p>I have been struck this week by Paul’s conviction, confidence and courage in the Lord to go out and preach the gospel message.  This just jumps off the pages of both the third person story-telling in Acts as well as Paul’s own letters.\n</p>\n<p><strong>Conviction</strong>\n</p>\n<p>It is inspiring to see the depth of Paul’s conviction that Jesus had specifically called him with a special message – to preach the gospel among the Gentiles.  As Caleb shared on Sunday, the early disciples were characterised by an unshakeable belief that Jesus had risen from the dead. They had seen Him!  What I find amazing about Paul is the depth of his conviction, not just in Jesus and His resurrection, but in the calling on his life.  His zeal for the Gentiles is clear and whilst he goes first into the synagogues at each place, he is soon back out amongst the Gentiles.  In the book of Galatians we see how incensed he is at the church there letting themselves be confused by the Jewish law and the requirement to be circumcised, when that is irrelevant for them.  There is a word of warning for us all:\n</p>\n<p>“<i>Are you so foolish?  After beginning with the Spirit, are you now trying to attain your goal by human effort?</i>” Gal. 3:3\n</p>\n<p>Do I have that level of conviction that what I believe is true and is true for everyone?  Could I go out into a public place and defend my faith as Paul does in Athens?  As Paul says: “<i>our gospel came to you not simply with words, but also with power, with the Holy Spirit and with deep conviction.</i>” 1 Thess 1:5\n</p>\n<p><strong>Confidence</strong>\n</p>\n<p>Closely linked to Paul’s conviction is His confidence in the gospel.  He would not be travelling the world preaching the gospel if he did not have the confidence that he would continue to see God move.  When he has a vision of a man in Macedonia begging him to come and help them, he gets ready to go at once, confident that God had called them to preach the gospel there too (Acts 16:9-10).\n</p>\n<p>In prison with Silas, and that wonderful scene of them praying and singing hymns to God, when the earthquake comes and the prison doors fly open, I sense a quiet confidence in Paul and Silas.  They knew God would show up – and not to free them but to bring salvation to the jailor and his family.  What faith.  It is humbling to read.\n</p>\n<p><strong>Courage</strong>\n</p>\n<p>In spite of the conviction he had after seeing the risen Jesus, and the confidence coming from a real gift of faith as he went on his missionary journeys, there is no doubt that all this will have required an immense amount of courage.  At the prayer meeting in Leeds last month we were encouraged to pray for boldness.  This is becoming a recurring theme and a natural outflow from our conviction and confidence in God.\n</p>\n<p>It’s good to realise that Paul was human and did need courage to keep going:\n</p>\n<p>“<i>We had previously suffered and been insulted in Philippi, as you know, but with the help of our God we dared to tell you his gospel in spite of strong opposition.</i>” 1 Thess 2:2\n</p>\n<p>It was far from plain sailing for Paul – plenty of floggings, time in prison and generally needing to keep on the move as they fled from those who were opposing them.  Was Paul tempted to give up and find a quieter, more comfortable life?  Of course not!  His calling was crystal clear and he was a man on a mission that no mere things like prison would distract him from.\n</p>\n<p>It is inspiring to read about.  How easily am I distracted by much more minor things than the risk of prison and choose to focus my thoughts and actions elsewhere rather than in the single-minded search for God’s kingdom and His righteousness?  Do I know my specific calling and what I should be doing to fulfil it?\n</p>\n<p>Big questions.\n</p>\n<p>You can <a href=\"https://drive.google.com/file/d/1Ua9y69ZMKbbRwmjvh6Y-ouPEVLCYHmDN/view?usp=sharing\" target=\"_blank\">download a copy of the Reading Plan here</a>.\n</p>\n<p>Photo by <a href=\"https://unsplash.com/photos/LJQEDQAmAnI?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Ben White</a> on <a href=\"https://unsplash.com/search/photos/gospel?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a><a href=\"https://unsplash.com/search/photos/lion?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\"></a><br>\n</p>",
  "colour": "purple",
  "date": "2018-02-12T11:22:00+00:00",
  "subtitle": "From January 1st through to Easter Sunday, we're inviting the church to read through the books of the New Testament together, following a plan that takes us chronologically through the Scriptures. Each week, we've invited a different person to reflect on what God has been saying to them through the readings of that week. This week, Jenny Herrera shares her observations on the sixth week of readings.",
  "title": "Conviction, Confidence and Courage",
  "image": "/uploads/ben-white-181034 (Medium).jpg"
}