{
  "authors": [
    {
      "author": "katie-greene"
    }
  ],
  "showOnPodcast": false,
  "itunesImage": "/uploads/logo.jpg",
  "deck": "<p>The four accounts of Jesus' life that we read in the Bible are packed with Jesus' teaching; in some ways they're like an instruction manual for life. Jesus’ teaching, while sometimes hard to hear, can inspire us with a vision for living a great life, but can also be convicting when we don’t live up to it.\n</p>\n<p>I must admit the repetition of the disciples' differing accounts of Jesus’ life in this week's readings were a struggle at first. However, by the end of the week I was enjoying spotting the slight differences – imagining what type of people the disciples were by the bits and pieces they remembered or had omitted.\n</p>\n<p>These readings were all from the significant time when Jesus’ death was becoming closer and closer, which he predicts to his disciples. However, I love the fact that Jesus focuses on instructing his followers and not wallowing in his own self-pity or thoughts. He takes the time to instruct us on ‘life’, and how we can be saved. Telling us ‘do not worry’ as God will provide (Luke 12), and giving guidance on how we can ‘inherit eternal life’ (Luke 18:18).\n</p>\n<p>Not only does Jesus not focus on himself, he makes sure we can prepare for what is to come, for our own salvation. There’s the instruction on several occasions not to build up worldly wealth, but instead to share it (Luke 12), as well as the repetition of the ten commandments – not to murder, steal, commit adultery, as well as the disciples' questions on divorce. As well as these practical rules, we also see Jesus reminding us to be humble - that those who ‘exalt themselves will be humbled, and those who humble themselves will be exalted’ (Luke 18:14). As well as being humble, we are also called to serve (Matthew 20), just as Jesus did when he walked the earth.\n</p>\n<p>These day-to-day instructions include a reminder from Jesus that prayer also plays an important role in everyday life, and that ‘if you believe, you will receive whatever you ask for in prayer' (Matthew 21:22). Not only was Jesus giving us the preparation for how to live a Godly life, but he was also reminding us of the constant need for communication with God and unfaltering belief in him.\n</p>\n<p>I was really struck this week by the large amount of instruction given by Jesus, but extremely humbled that amid his own impending death he wasn’t focusing on himself, but giving his followers the commandments to attain eternal life; not just worrying over possessions and wealth, but living a life pleasing to God and one that reflects all that God has in store for us.\n</p>\n<p>I’ve come to the last day of these readings and have been thoroughly challenged about being humble, servant-hearted and preparing for what is to come.\n</p>\n<p>Is there an area of your life where you need to apply his instruction more? Maybe worry less, or dedicate more time to prayer? Whatever these readings have provoked in you, start by giving them to God and asking for his guidance.\n</p>\n<p>You can <a href=\"https://drive.google.com/file/d/1Ua9y69ZMKbbRwmjvh6Y-ouPEVLCYHmDN/view?usp=sharing\" target=\"_blank\">download a copy of the Reading Plan here</a>.<br>\n</p>\n<p>Photo by <a href=\"https://unsplash.com/photos/4K2lIP0zc_k?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Ben White</a> on <a href=\"https://unsplash.com/search/photos/worry?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a>\n</p>",
  "colour": "purple",
  "date": "2018-01-22T12:23:00+00:00",
  "subtitle": "From January 1st through to Easter Sunday, we're inviting the church to read through the books of the New Testament together, following a plan that takes us chronologically through the Scriptures. Each week, we've invited a different person to reflect on what God has been saying to them through the readings of that week. This week, Katie Greene shares her observations on the third week of readings.",
  "title": "Do not worry",
  "image": "/uploads/ben-white-128604 (Medium).jpg"
}