{
  "authors": [
    {
      "author": "caleb-ellwood"
    }
  ],
  "showOnPodcast": false,
  "itunesImage": "/uploads/logo.jpg",
  "deck": "<p>In our family we've usually taken all of our Christmas decorations down before we've even hit New Year's Eve. I know we're supposed to leave them up until the 12 days of Christmas have gone, but when the shops have had decorations up for 3 months already, I'm ready to move on from Christmas and get ready for January to start.<br>\n</p>\n<p>It felt a little odd to start the reading plan on January 1<sup>st</sup> with the nativity story, having in my mind already moved on from \"Christmas mode\" into \"January mode\". But I'll admit it, I actually enjoyed it. Sometimes, even as Christians, we're guilty of packing our teaching, reflecting and celebrating of Christmas away for the year along with our Christmas decorations, only to revisit it again the following December. We've linked the Christmas story with December to an extent that we don't dwell on the incredible nativity story during the other 11 months of the year.\n</p>\n<p>But the Christmas story is as relevant in January or June as it is in December.\n</p>\n<p>John says, \"<strong>The Word became flesh and made his dwelling among us</strong>.\"<sup>1</sup>  Matthew recounts Isaiah prophesying hundreds of years earlier that the son born to a virgin would be called <strong>Emmanuel (which means 'God with us')</strong><sup>2</sup>. The Word didn't become flesh and make his dwelling among us for December, then go and make his dwelling elsewhere in January. God didn't become Emmanuel and stay with us for a few days before deciding he had had enough of us.\n</p>\n<p>God is for life, not just for Christmas (I couldn't resist!).\n</p>\n<p>Every month of the year, we can celebrate the God who loved us so much that he literally stepped into our story, becoming fully human, walking with us, teaching us and ultimately dying for us before conquering death and rising to new life. The first Christmas kicked off a new chapter in the story of God and mankind. From that point on he would be \"God with us\" in a new way. This continues today.\n</p>\n<p>God is with us.\n</p>\n<p>Every moment of every day.\n</p>\n<p>Every month of the year.\n</p>\n<p>I don't know about you, but one of my greatest challenges is to live in the awareness of him being with us at all times.\n</p>\n<p>A team of us from various churches in Acomb do a weekly assembly in one of the local primary schools. We act out (badly) a different story from the Bible each week. We do the assemblies for children in 4 different year groups, and it takes us about 2 years to get through all the stories in our Storybook Bible. Once we've finished the Bible, we just start again from the beginning. What this means is that we rarely have the stories at the \"right\" time of the year. This year we were acting out the Christmas story at Easter, and the Easter story at Christmas. Again, it felt a little jarring to do this. And certainly, some of the teachers found it amusing! But for me, it was incredibly powerful to help the children join the dots between the Jesus who came as a baby and the Jesus who died and rose again.\n</p>\n<p>My hope and prayer is that for some of those children, we're able to help them see the significance of Jesus beyond what they have neatly packaged to them during the \"right\" times of the year.\n</p>\n<p>My hope and prayer for all of us is that we'll continue to allow the Christmas story to transcend December; that we'll remember every day of the year that God stepped into our world to be Emmanuel - God with us.\n</p>\n<p><sup>1. John 1:14\n\t</sup>\n</p>\n<p><sup>2. Matthew 1:23 quoting Isaiah 7:14\n\t</sup>\n</p>\n<p>You can <a href=\"https://drive.google.com/file/d/1Ua9y69ZMKbbRwmjvh6Y-ouPEVLCYHmDN/view?usp=sharing\" target=\"_blank\">download a copy of the Reading Plan here</a>.\n</p>\n<p>Photo by <a href=\"https://unsplash.com/photos/dABKxsPTAEk?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Gareth Harper</a> on <a href=\"https://unsplash.com/?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a>\n</p>",
  "colour": "purple",
  "date": "2018-01-08T12:29:00+00:00",
  "subtitle": "From January 1st through to Easter Sunday, we're inviting the church to read through the books of the New Testament together, following a plan that takes us chronologically through the Scriptures. Each week, we've invited a different person to reflect on what God has been saying to them through the readings of that week. This week, Caleb Ellwood shares his observations on the first 7 days of readings.",
  "title": "God with us",
  "image": "/uploads/gareth-harper-175342 (Medium).jpg"
}