{
  "authors": [
    {
      "author": "john-wilson"
    }
  ],
  "showOnPodcast": false,
  "itunesImage": "/uploads/logo.jpg",
  "deck": "<p><strong>If God is good why does he seem so angry?</strong>\n</p>\n<p>(Edited transcript of talk by John Wilson on 091016 – Part 1 of series “Is God Good?”)\n</p>\n<p>If there’s one popular image of God it has to be him striking someone with lightning for doing something he disapproves of.  Behind the cartoon images is a perception that God is generally angry and inclined to lash out, so you don’t want to get on the wrong side of him. We even refer to severe weather events as “acts of God.”\n</p>\n<p>If we’re honest, even those of us who are card-carrying Christians, at times, can find doubts creeping in. When we read certain passages in the bible, when we look at the terrible things going on in the world, or more particularly when we face painful situations in our own lives, we begin to wonder <strong>“Is God really good?”</strong>\n</p>\n<p>Over the next 3 weeks my aim is to come at this topic from a number of angles. This morning I want to look at God as portrayed in the Old Testament.\n</p>\n<p>Let me start with a quote from a popular book:\n</p>\n<p><i>‘The God of the Old Testament is arguably the most unpleasant character in all fiction: jealous and proud of it; a petty, unjust, unforgiving control freak; a vindictive, bloodthirsty ethnic cleanser; a misogynistic, homophobic, racist, infanticidal, genocidal, filicidal, pestilential, megalomaniacal, sadomasochistic, capriciously malevolent bully.”</i>\n</p>\n<p>(Richard Dawkins – The God Delusion).\n</p>\n<p>Other critics of God might be more measured in how they express it, but this is increasingly the mainstream view in our society – that the God portrayed in the OT is definitely NOT good, and has no place in the 21<sup>st</sup> Century.  Apparently now we’re in the 21<sup>st</sup> C people are so much wiser and better equipped to judge what’s good than we were previously.\n</p>\n<p>There are numerous passages in the OT that people use to support that view. If we’re honest, some of those passages can leave us feeling uncomfortable too.\n</p>\n<p>However, we should resist any reading of the bible that sets up a contrast between a mean OT God and a much nicer NT God.  Like God underwent some kind of personality change. There’s only one God, who reveals himself as Father, Son and Holy Spirit.\n</p>\n<p>In the OT, God is known by various names and titles.  But his personal name – the name he invited his people to call him by – is YAHWEH.  Traditionally it was rendered in English as Jehovah, but more accurately it is YHWH (no vowels).  In modern English bibles “the LORD”. It’s always seemed unfortunate to me that we’ve substututed a title for his name. A name is more personal.  It lends itself better to relationship. And that’s what God invites people into – both in the OT and in the NT.\n</p>\n<p>However The OT describes Yahweh as being slow to anger. It’s so much part of his character that he includes it in his name when he introduces himself to Moses on Mount Sinai:\n</p>\n<p><i>The LORD, the LORD, the compassionate and gracious God, slow to anger, abounding in steadfast love and faithfulness.” (Exodus 34:5-6)</i>\n</p>\n<p>The Hebrew word we translate as “steadfast love” is <i>hesed</i>. It can also be translated as lovingkindness, love or mercy. The closest we come is perhaps the love of a devoted parent to a child from infancy to adulthood and beyond.  Or the tender love of a husband and wife husband over decades of marriage. It’s not a word to be used lightly.\n</p>\n<p>The word occurs 251 times in the OT, and in the vast majority of instances it’s used to describe God.  His abundant or overwhelming <i>hesed</i>, or steadfast love, endures forever.\n</p>\n<p>SO…is God angry at times? Yes. Is he loving? Yes. Anger and love are not mutually exclusive.  Anger about a breakdown in relationship is often the first step towards forgiveness and reconciliation. Anger at injustice and oppression are often the first step to doing something about it.  An absence of anger can be a symptom of indifference rather than a lack of love.\n</p>\n<p>Clearly we haven’t time to cover all the problem passages in the OT, so what I’d like to do this morning is look at just one incident where God is angry, and what I hope to show you is that things are not always what they appear. Every incident is part of a bigger story – the story of God’s steadfast love in restoring a fallen human race to its original glory as his image – bearers.\n</p>\n<p>That redemptive purpose sometimes requires radical action on God’s part.\n</p>\n<p>But remember that God is no armchair general sacrificing men and women in pursuit of some grand strategic objective. He’s the king who comes to rescue his people and to give his life on the cross as a ransom. Every story in the OT anticipates this amazing demonstration of God’s steadfast love.\n</p>\n<p>With that in mind let’s look at a specific story from the OT that is often referred to by those who take a dim view of God:\n</p>\n<p><strong>Uzzah and the Ark - 2 Samuel 6:1-10 </strong>\n</p>\n<p><strong> </strong>\n</p>\n<p>This is one of those passages that people read and say ‘I don’t want anything to do with a God like that.<strong></strong>Maybe you’ve felt that yourself.\n</p>\n<p><strong> </strong>\n</p>\n<p>Just to be clear, the ark in question here isn’t the one that Noah built for sailing in, but the one that The Lord instructed Moses to make on the journey to the promised land. <strong></strong>\n</p>\n<p>The word we translate ark simply means a chest or a box. (Picture)\n</p>\n<p>It was about 4 feet long by about 2.5 feet wide and high, overlaid with gold, and on top was a slab of gold known as the mercy seat, with 2 angels spreading their wings over it.\n</p>\n<p>The ark was the most important piece of furniture in the tabernacle. It was the centrepiece in the Holy of Holies – The most Holy Place.\n</p>\n<p>Here’s a floor plan of the tabernacle. And there in the Holy of Holies, over the ark appeared the shekinah – the glory of God; the infinitely holy, brilliant presence of the transcendent God.\n</p>\n<p>There was no more sacred object in the history of Israel than the ark.\n</p>\n<p>Some years before this incident we just read about, the ark had been captured by the Philistines. The sons of the High priest had decided to take the ark into battle, because they thought that would assure Israel of victory. They were treating it like some kind of lucky charm. And the Philistines defeated them and captured the ark.\n</p>\n<p>However they quickly realized it was a very dangerous thing to have around and sent it back to Israel. But the Israelites didn’t know what to do with it either, and for 20 years it had stayed in the house of a man called Abinadab, and his 2 sons Ahio and Uzzah, who feature in our story.\n</p>\n<p>Meanwhile, David had become King, and established Jerusalem as his capital. And now he wanted to bring the ark there. He wanted God to be at the centre of their national life. But David had a personal motivation too in wanting to bring the ark to Jerusalem. He was a man who depended on God. Psalm 27:\n</p>\n<p><i>“One thing I ask of the Lord, this is what I seek: that I may dwell in the house of the LORD all the days of my life, to gaze upon the beauty of the LORD and to seek him in his temple.</i>\n</p>\n<p><i> </i>\n</p>\n<p><i>For in the day of trouble he will keep me safe in his dwelling; he will hide me in his tabernacle and set me high upon a rock. Then my head will be exalted above the enemies who surround me; at his tabernacle will I sacrifice with shouts of joy.”</i>\n</p>\n<p>David understood the pressures that came with being king – he knew that if he was going to make it he needed God’s presence - spiritual reality. This is what the ark represented.\n</p>\n<p>Isn’t it the same with you and me? That if we’re going to live our lives as God intends then we need spiritual reality. It’s one thing to know in your head that God loves you. But only when his love is real in your heart can you begin to live freely and confidently. Secure in your identity as a child of God. Not driven by the need to prove yourself or by what other people think.\n</p>\n<p>David knew that if he had spiritual reality then his joy wouldn’t be subject to his circumstances. Don’t you and I want that too? The face of God, the presence, the glory?\n</p>\n<p>That was what the ark represented. But there was a problem. The ark was a dangerous thing to be around.\n</p>\n<p>As I said, The Philistines found that out the hard way. When they put it in the temple of their god Dagon, they came back in the morning and found Dagon lying face down before the ark. They stood him up again but when they came back he was back on his face again, this time with his head and hands broken off.\n</p>\n<p>In every town they took the ark, people were afflicted with tumours.\n</p>\n<p>Before long they put it on a cart and sent it back to Israel. It turned up in the village of Beth Shemesh and the people said “oh look, the ark, let’s take a peek inside”. And 70 of them died.\n</p>\n<p>And so it ended up in the house of Abinadab. And now, 20 years later, David shows up with 30,000 men to get it.\n</p>\n<p>It’s a massive, festive occasion –cf Nottinghill carnival – big parade, marching band.  People are excited. At one point the cart wobbles a bit, and instinctively Uzzah, walking alongside, reaches out to steady the ark.  When I read that I can easily imagine myself doing the same thing, can’t you? But God is angry and strikes Uzzah dead.  The parade comes to a halt.  The band stops playing. People are stunned. David is angry. He thought he was trying to do the right thing, and God goes and ruins the occasion with what could easily appear to be some kind of petulant display of anger.\n</p>\n<p>People have answered that question in a number of ways.\n</p>\n<p>1. Uzzah died because there was some kind of force field around the ark that zapped him. Cool idea but owes more to Indiana Jones than the bible.\n</p>\n<p>2. It was God’s response to disobedience and lack of respect.\n</p>\n<p>This is more credible. God had given them very clear rules about how they were to transport the ark.\n</p>\n<p>It had to be covered – not made into a public spectacle\n</p>\n<p>It had to be carried – not loaded onto a cart. There were rings on the side for poles\n</p>\n<p>It couldn’t be touched\n</p>\n<p>Every one of those rules was disregarded.\n</p>\n<p>To our contemporary, casual sensibilities, Yahweh’s concern with ark transportation might seem a bit OCD. But the rules were there to protect people.\n</p>\n<p>It’s a bit like handling radioactive material.  There are very strict rules about how to transport it, for the very good reason that if you’re careless, people die. The guidelines for handling the ark were there to protect people.\n</p>\n<p>Sinful people can’t just wander into the presence of a holy God any way they feel like it. It’s dangerous.\n</p>\n<p>Also, handling the ark in the way they did not only involved disobedience, it was hugely <strong><u>disrespectful</u></strong>.\n</p>\n<p>Remember what the ark represented – it wasn’t just a box – it represented the presence of God.  Essentially, it was like a litter – a kind of throne for a king to be carried on. (picture). You see the same thing in other ancient cultures like China and Egypt.\n</p>\n<p>It was a mark of honour.  They would NEVER have transported a dignitary or royal person on a cart.\n</p>\n<p>Imagine if the queen came to visit York and the city council asked her to jump in the boot of someone’s car.  That’s basically what Israel was doing with God.\n</p>\n<p><strong>So is that what this is all about? Because they didn’t follow the rules and show Him respect, God was angry and Uzzah paid the price?</strong>\n</p>\n<p>That’s how this story is sometimes applied. God expects our obedience and respect and if you don’t shape up he’s going to be angry with you.\n</p>\n<p>My own view is that this story is more about <strong>what God does for us</strong> rather than about what we’re supposed to do for God.\n</p>\n<p>The cause of Uzzah’s death was not just that he broke the rules and or showed disrespect or indifference. All those things were in play. But they were symptoms rather than the cause. If they had been the cause, then why weren’t they ALL struck down the moment they lifted the ark onto the cart? Uzzah couldn’t have done it on his own.\n</p>\n<p>And what about DAVID? He was the guy in charge. When a team’s playing badly who gets fired? Not the players – the manager!\n</p>\n<p>What I believe the story of the ark highlights is the CHASM between sinful man and a holy God. A chasm that we can’t bridge with religion or morality or even our devotion. A chasm that even God can’t bridge with just a snap of his fingers. Sin has to be paid for. He can’t just say “let bygones be bygones”. There has to be a sacrifice. An atonement. There’s a debt that has to be paid. If we don’t see that chasm, if we don’t realize it’s there, then there is no hope for us.\n</p>\n<p><strong>BECAUSE ONLY WHEN WE’VE SEEN THE CHASM CAN WE SEE THE CURE.</strong>\n</p>\n<p>Uzzah thought like all religious people think  - I’m doing God a favour here.”\n</p>\n<p>He thought he was a good person – that he could manage God – give God a hand. Maybe growing up with the ark in his house had led him to see himself as God’s caretaker.\n</p>\n<p>This attitude is lethal. And God in his mercy wanted to give them a wake up call – especially to David.\n</p>\n<p><strong>How does this apply to us?</strong>\n</p>\n<p><strong> </strong>\n</p>\n<p>As I see it, it’s a story about the futility of our self-righteousness. Don’t make the mistake of thinking you can manage God. By being a good person, by holding the “right beliefs”, by reading your bible, by being devoted.\n</p>\n<p>In trying to protect the ark Uzzah seemed noble and religious. But our best attempts to be good are utterly insufficient to bridge the chasm between us and God. The only thing that bridges the chasm is the grace of our Lord Jesus Christ.\n</p>\n<p>The story of Uzzah points us to the New Covenant where the ark that was too holy to touch becomes the symbol of God’s grace. In Jesus, we are made holy. NOW, You can approach God with confidence and without fear.\n</p>\n<p>The last part of the story illustrates what needs to happen.\n</p>\n<p>Step 1. <strong>We need to see the chasm.</strong> When Uzzah was struck down, David was shocked. He saw the chasm. He said (verse 9) “How can the ark of the LORD ever come to me?” How can I ever experience God’s presence?\n</p>\n<p>He’s wrong – but he’s a lot closer than he was when he didn’t realize the chasm was there.\n</p>\n<p>Step 2. <strong>We need to see the cure</strong> – God doesn’t just want you to know the bad news – that you’re more wicked than you ever imagined. He also wants you to see the good news – that you can be more loved and accepted than you ever dared to hope.\n</p>\n<p>In the tabernacle, there was only one man who was permitted to enter the Holy of Holies where the glory of God was present above the ark. That was the High Priest. If anyone else entered they would die. And even he could enter only on one day each year, on the day of atonement, which as it happens, falls next Wednesday.\n</p>\n<p>He went in for a specific purpose – to atone for the sins of the people. This he did by sprinkling the blood of the sacrifice on the mercy seat.\n</p>\n<p>For the chasm to be bridged, for sins to be atoned for, there has to be a sacrifice.\n</p>\n<p>Why? If God wants to forgive us, why couldn’t he just forgive? Why does it need a sacrifice?\n</p>\n<p>Because forgiveness always requires suffering. If you don’t see that it’s because you’ve never been wronged very badly. If you’ve ever been hurt very badly you feel there’s an injustice, a debt to be paid. You can’t just shrug it off. You can do one of two things. You can make THEM pay, in which case they suffer. Or you can forgive, in which case YOU choose to absorb the suffering. Forgiving someone who has badly wronged you is a painful process. It leads to life, but it’s hard.\n</p>\n<p>You can either make them pay, and evil spreads. Or you can pay the price yourself, and evil is overcome. If that’s true of us, then how much more will God have to suffer in order to forgive us – our disobedience and disrespect and indifference, and all the sin in this world.\n</p>\n<p>And on the Cross, that’s exactly what we see happening. What we do in a small way internally and subjectively, each time we choose to forgive, God does objectively and cosmically on the cross. He suffers for the sins of the world. There was no way round it. He couldn’t just say “Oh let bygones be bygones.” Someone has to pay.\n</p>\n<p>The ark with its mercy seat was a shadow of what was to come, a signpost pointing forward to the atonement that Christ would bring about through his once-for all sacrifice on the cross.\n</p>\n<p>That’s why the book of Hebrews tells us that the tabernacle and everything in it is a shadow, a signpost pointing to eternal realities. And that Jesus, the Son of David, our great High Priest, entered the true Holy of Holies on our behalf - not with the blood of animals but with by His own blood – to atone for our sin. Not once a year but once for all -  forever.\n</p>\n<p>And because of that the writer of Hebrews says this:\n</p>\n<p><i>“Let us then approach the throne of grace with confidence, so that we may receive mercy find grace to help us in our time of need.” Hebrews 4:16</i>\n</p>\n<p><strong>The throne of grace is a reference to the mercy seat on the ark. </strong>\n</p>\n<p>Uzzah couldn’t touch the symbol of God’s presence without dying. But, in Christ, you and I can come into God’s presence and live.  The chasm has been bridged.\n</p>\n<p>That’s the gospel. That’s what was at stake in the story of Uzzah and the ark. And that’s what David came to see.\n</p>\n<p>After 3 months he heard that the LORD had blessed the household of Obed Edom, where the ark was being kept. And so once more he went to bring it back to Jerusalem.\n</p>\n<p>Only this time he had it carried by the poles, not loaded onto a cart. And when they had taken six steps, he stopped and made a sacrifice. He’d seen the chasm. And he’d seen the cure.\n</p>\n<p>And the story says that he danced before the Lord. That wasn’t something kings were supposed to do. They were supposed to behave in a dignified way. He was criticized for doing it. But he didn’t care what people thought. Now he knew God’s grace; God’s presence.\n</p>\n<p>When you’ve seen the chasm, and seen the cure, then joy comes into your life. Security. Confidence in your identity. There’s nothing you need to prove.\n</p>\n<p>That’s the difference between a religious person and a gospel-transformed person. If your relationship with God is about you trying hard and hoping God will see that and come out to bat for you, there’s no joy in that.\n</p>\n<p>But if it’s that God took the suffering upon himself to satisfy the need for justice and bridge the chasm so you can enjoy the presence of a holy God. And he did that for you…that changes everything.\n</p>\n<p><i> </i>\n</p>\n<p><i>What an incredible blessing and privilege it is to come to the very throne of grace – the mercy seat – without fear -  because of the work of Christ on your behalf!</i>\n</p>\n<p>The story of Uzzah is part of the story of the steadfast love of a good God.\n</p>",
  "colour": "green",
  "date": "2016-10-09T12:00:00+01:00",
  "subtitle": "John Wilson begins a new series looking at the question: Is God good?",
  "title": "If God is good, why does he seem so angry?",
  "image": "/uploads/Is Good good.jpg"
}