{
  "authors": [],
  "showOnPodcast": false,
  "itunesImage": "/uploads/logo.jpg",
  "deck": "<p>As a stay at home parent of small children I must admit that finding time to read my bible can be challenging. After a long day of running around after my active boys, running a household, satisfying my various volunteer roles, and keeping up to date on friends and family, sitting down in silence with a book is more likely to result in an unplanned nap rather than some deep reflections on the Word!\n</p>\n<p>This is where the reading plan has been invaluable, the motivation of knowing that the rest of the church are all reading along with me and experiencing these verses at the same time has spurred me on to carve out a smidge more time every day, and muster up a tiny bit of extra energy to devote myself to the Word. I’m more grateful than ever to be a part of a faith-filled, bible-based church.\n</p>\n<p>The beautiful thing about the verses we have been reading this week is that we have been experiencing Jesus in action. We sit and listen to the sermon on the mount. We see him feed the multitude with just a few loaves and fish. We have sailed with him on the Sea of Galilee, been to dinner in the house of Matthew the tax collector with all his sin loving buddies, walked through the towns and met people with him, and been privileged to have witnessed his miracles.\n</p>\n<p>What has stood out to me the most has been the absolute faith of some of the people Jesus encountered. The army officer (Luke 7 &amp; Matthew 8) who wanted his servant healed. The synagogue leader, Jairus (Mark 5, Matthew 9 &amp; Luke 8), whose daughter was gravely ill. The woman with the issue of blood (Matthew 9, Mark 5 &amp; Luke 8). These people had not yet themselves experienced a miracle, but in their need they reached out to Jesus with complete confidence and faith that he could help. I think sometimes it can be easy to forget that we serve a supernatural God, the God of miracles. We serve the same God as the army officer, as Jairus, and this woman. It can be easy, in the midst of trial or worry, to wrack our brains for the best solutions we can find, to fret and worry, to consult the counsel of friends and family, or to look online for answers or support. But what the bible teaches us is that we should do everything we can to bring our problems to Jesus.\n</p>\n<p>I’ve been a Christian for 15 years now, and I couldn’t even tell you the number of times that I have been discussing a worry or problem with a friend and they’ve asked, “Have you prayed about it?” and I hadn’t. Why prayer isn’t always my first response to worry, I’m not sure, but I can only say how grateful I am that we serve a loving God who forgives my mistakes, sends me wise Christian friends to counsel me, and wants to heal my heart and help me with my worries if only I will have faith in him.\n</p>\n<p>You can <a href=\"https://drive.google.com/file/d/1Ua9y69ZMKbbRwmjvh6Y-ouPEVLCYHmDN/view?usp=sharing\" target=\"_blank\">download a copy of the Reading Plan here</a>.<br>\n</p>\n<p>Photo by <a href=\"https://unsplash.com/photos/TNlHf4m4gpI?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Aaron Burden</a> on <a href=\"https://unsplash.com/search/photos/jesus?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a><span class=\"redactor-invisible-space\"><br></span>\n</p>",
  "colour": "purple",
  "date": "2018-01-15T13:14:00+00:00",
  "subtitle": "From January 1st through to Easter Sunday, we're inviting the church to read through the books of the New Testament together, following a plan that takes us chronologically through the Scriptures. Each week, we've invited a different person to reflect on what God has been saying to them through the readings of that week. This week, Amy Hoskin shares her observations on the second week of readings.",
  "title": "Jesus the miracle worker",
  "image": "/uploads/aaron-burden-287555.jpg"
}