{
  "authors": [
    {
      "author": "bethany-wheeler"
    }
  ],
  "showOnPodcast": false,
  "itunesImage": "/uploads/logo.jpg",
  "deck": "<p>This week’s readings took us from Jesus’ crucifixion through to the first half of Acts. I find tonnes of reassurance in the way that Jesus’ followers responded to his arrest, death and resurrection. They basically just couldn’t believe it; they couldn’t believe he was about to die, and then they couldn’t believe he’d come back to life. It took so many times for them to get it, that Jesus really was the Messiah, and that this signalled the coming of God’s kingdom.\n</p>\n<p>But then there’s a bit I really loved. In Acts 1, Jesus was eating with his disciples, and he told them about the Holy Spirit. They had kept asking him, “Lord, has the time come for you to free Israel and restore our kingdom?” I imagine them to be feeling all smug because they’d finally got it, they knew what was coming next, and were impatient for Jesus to get on with it. In his reply he gives one of those answers where he turns a “no” into a “not yet.” He basically says “not to worry about the timings, leave that to God” (Acts 1:7). “BUT,” he says, “But you will receive power when the Holy Spirit comes upon you. And you will be my witnesses, telling people about me everywhere” (Acts 1:8). The disciples are expecting some immediate swooshing in of God’s restoring of the world, but Jesus tells them the next big unexpected thing about his upside-down kingdom…You. Me. Us. We’re going to be the ushering in of God’s kingdom. He’s using us to do it.\n</p>\n<p>But not on our own. Our power to do that will only come when we’ve received the Holy Spirit. So then we have a load of chapters of amazing stories of the power that the apostles have, because of the Holy Spirit. Miracles. Lame people walking. Dead people coming back to life. People who had never met Jesus for themselves choosing to follow him now, because of what they were seeing in the lives of the apostles.\n</p>\n<p>It is such an exciting read. But, like Caleb said in his talk this Sunday, there is a gap between what we read and what we’re experiencing in our lives, in our church today. Here are two things about that, which challenged me in this week’s readings.\n</p>\n<p>Firstly, those brave, courageous, Spirit-filled followers of Jesus had their eyes firmly fixed on him, on the prize of sharing in his glory. When the angel broke them out of prison, they went straight back to preaching, knowing they’d probably end up being arrested again, because their own comfort was less important than getting the gospel-message out there. When Stephen was in serious trouble and would soon be stoned to death he “full of the Holy Spirit, gazed steadily into heaven and saw the glory of God” (Acts 7:55). His eyes were fixed on heaven, and because of what he saw there, he could face anything here on earth.\n</p>\n<p>I don’t face persecution for being a Christian, but I do face some challenges, and this week I’m going to try to not let them distract me from keeping my eyes, my heart and mind fixed on Jesus.\n</p>\n<p>Secondly, the apostles paid attention to the people around them. When the lame man called out to Peter and John asking for money it says in Acts 3:4 that they “looked at him intently”, before healing him. How intently or intentionally do I look at the people around me? If I don’t see people at all, I can’t expect God to answer my prayer to see them like he does. So, this week I’m aiming to be more aware of the little interactions with the people around me, to look intently, instead of just rushing past to the next job – I’m excited to see where God will lead me.\n</p>\n<p>You can <a href=\"https://drive.google.com/file/d/1Ua9y69ZMKbbRwmjvh6Y-ouPEVLCYHmDN/view?usp=sharing\" target=\"_blank\">download a copy of the Reading Plan here</a>.<br>\n</p>\n<p>Photo by <a href=\"https://unsplash.com/photos/QyCH5jwrD_A?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Kira auf der Heide</a> on <a href=\"https://unsplash.com/search/photos/receiving?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a><span class=\"redactor-invisible-space\"><br></span>\n</p>",
  "colour": "purple",
  "date": "2018-02-05T10:57:00+00:00",
  "subtitle": "From January 1st through to Easter Sunday, we're inviting the church to read through the books of the New Testament together, following a plan that takes us chronologically through the Scriptures. Each week, we've invited a different person to reflect on what God has been saying to them through the readings of that week. This week, Bethany Wheeler shares her observations on the fifth week of readings.",
  "title": "Receiving the power",
  "image": "/uploads/kira-auf-der-heide-352824 (Medium).jpg"
}