{
  "authors": [],
  "showOnPodcast": false,
  "itunesImage": "/uploads/logo.jpg",
  "deck": "<p>This week's reading is another whirlwind of both adventure and practical teachings through Paul.<br>\n</p>\n<p>To me, reading the New Testament in a chronological order has brought a new perspective and admiration of Paul's ministry in two areas which I'll touch on in turn;\n</p>\n<ol>\n\t<li>Paul's wreckless abandon and full submission to God in order to spread the Gospel</li>\n\t<li>Paul's concise and practical teachings that he brings to the church</li>\n</ol>\n<p>First, we read of Paul's ordeal; being locked up, beaten up, plots to kill him, travelling towards certain danger, arrested and being shipwrecked. And he uses these life threatening and humiliating situations as opportunities to share his testimony, prophesy and proclaim the good news of Jesus. I'm not sure I would have the same composure.\n</p>\n<p>God was with Paul throughout his journey. We know that God is with us too. However, unlike Paul I don't often find myself shipwrecked or chased by angry crowds. However, we can sometimes use uncomfortable, and possibly life threatening situations as an opportunity to share our faith and God's love with others. For me, recently, this has been with friends, family and colleagues plagued by ill health.\n</p>\n<p>But there are many more situations where it is difficult to be honest in our faith, especially as we try to \"fit in\". I love how Paul ignores circumstance and cuts through these issues in his short, concise teachings and instructions to the churches and in addressing crowds.\n</p>\n<p>That leads to my second point. From working in consultancy it's clear that waffle doesn't go down well. People want clear, short and succinct advice. Paul seems to communicate in this style with ease, particularly in the books of Romans and Colossians. For example:\n</p>\n<p>\"But now you must also rid yourselves of all such things as these: anger, rage, malice, slander, and filthy language from your lips.\" Colossians 3:8\n</p>\n<p>Paul's teachings to the early church, the Jewish crowds, governors and officials are always clear. They're blunt. They're practical for the church and also for us as individuals. They're also 100% aligned with the message Jesus brings to us. And it is effective in growing the early church. But this doesn't mean the messages are easy... in fact they are often very challenging, especially in a society today where it can feel like what used to be extreme is now normal.\n</p>\n<p>To conclude, Paul's reckless abandon to share the Gospel, no matter how bad his circumstances, is inspirational. He admits being prepared to die for the name of the Lord Jesus (Acts 21:13) and is undeterred in his ministry. But Paul is also effective in addressing an audience clearly and concisely. To have both qualities in such magnitude must only come from being filled with the Holy Spirit. To me then, Paul's ministry is an excellent example as to why we should eagerly desire the gifts of the Holy Spirit as we live to share the Gospel too.\n</p>\n<p>You can <a href=\"https://drive.google.com/file/d/1Ua9y69ZMKbbRwmjvh6Y-ouPEVLCYHmDN/view?usp=sharing\" target=\"_blank\">download a copy of the Reading Plan here</a>.<br>\n</p>\n<p>Photo by <a href=\"https://unsplash.com/photos/5H3TYR__5mo?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Lloyd Dirks</a> on <a href=\"https://unsplash.com/search/photos/shipwreck?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a><span class=\"redactor-invisible-space\"><br></span>\n</p>",
  "colour": "purple",
  "date": "2018-03-05T11:14:00+00:00",
  "subtitle": "From January 1st through to Easter Sunday, we're inviting the church to read through the books of the New Testament together, following a plan that takes us chronologically through the Scriptures. Each week, we've invited a different person to reflect on what God has been saying to them through the readings of that week. This week, Alex dB shares his observations on week nine of our readings.",
  "title": "Reckless Abandon for the Gospel",
  "image": "/uploads/lloyd-dirks-113416-unsplash (Medium).jpg"
}