{
  "authors": [
    {
      "author": "ali-hogben"
    }
  ],
  "showOnPodcast": false,
  "itunesImage": "/uploads/logo.jpg",
  "deck": "<p>I wonder how many times you have used or heard the phrase “in hindsight...”?\n</p>\n<p>We often apply this phrase to poor choices we or others have made, a reaction to events that have taken place and as a note of caution, maybe a nod towards a lesson learned.\n</p>\n<p>In Paul’s writings this week, I was struck by his references to both current circumstance but also to his and others eternal destiny, often in the same breath. It led me to think about how Paul viewed the world, how he described his and others joy and troubles, but constantly in the context of “the joy that is to come” and never “in hindsight”, either reviewing anything that had happened or regretting its occurrence. Simply put, Paul’s focus was not on what had past but on what was to come, in every circumstance his viewpoint was the promise of eternal life.\n</p>\n<p>This led me to think more on living life with this viewpoint, rather than in hindsight, and understanding the importance of having a \"heavenly perspective”\n</p>\n<p>In his letters to Corinth and Rome, Paul brings his message in the context of the troubles that he and others are experiencing but constantly encourages his readers that the focus of life and work should be on what is to come, on the promises of eternal life. Whilst he does not discount his current experiences, he recognises them for what they are and encourages his readers to live with a heavenly perspective, one that recognises the current condition of earthly circumstance but that does not then conclude that events here will dictate our destiny. He encourages us that when we accept Jesus, we are redeemed and saved at the cross and all who approach are welcomed with open arms. Furthermore, Paul writes that if we are really viewing life from this heavenly perspective rather than an earthly one, no matter what our experiences are, we will always be prompted and encouraged to share the good news of salvation and to act in a way that reflects Christ himself, because we will know that this life is fleeting and there are more important things to come.\n</p>\n<p>Now forgive me, (confession time and I don’t know about how you react in these situations dear reader...), but there are days when sharing the gospel feels like the thing furthest from my thoughts during difficult times. In fact, when I think on my past troubles and trials, I often think that some of my reactions and thoughts were some of the least Godly or Salvation-worthy actions I have ever taken, and I can’t say that every time I am frustrated at my desk at work, my first reaction is to speak to one of my colleagues about Jesus’ undying love for them...\n</p>\n<p>But Paul encourages us further that when we struggle and cry out to God, when we trust in him, even when we are struggling to find hope, this is when the Spirit takes hold. Whilst we may struggle with earthly troubles, with lack of things or with trying circumstances, if we allow the spirit of God to work in us at these times, this is the example of Jesus, the good news, that we share with the world. It is not a rose-coloured picture of God, of a religion or relationship for when “life is easy”, but it shows us as having a raw and honest relationship with a Father who loves us, whether we do right or wrong and whether we understand it or not. So whilst my colleagues may not hear me talk about Jesus at these times, it is my hope that they see through my actions and demeanour that he reigns in my life at ALL times, good and bad. And as Paul says, for the times when this doesn’t happen, we live under abundant grace!\n</p>\n<p>I find it wonderfully encouraging that despite our weakness and failings, the Spirit will still proclaim Jesus through us, even in difficulties and troubles, and he will intercede on our behalf, calling on God for us and seeking his will... And God doesn’t stop there! As Paul writes, God continues to bless us when our hearts are aligned with his, encouraging us to share the abundance of grace, mercy and gifting that he has lavished on us, encouraging us to share it with all who are around us.\n</p>\n<p>I think if these thoughts were always at the forefront of our minds, in all circumstances, the knowledge that we are saved, loved and redeemed, that when Earth is done we have the ultimate hope, the way we live would be different.\n</p>\n<p>It is this heavenly perspective, the focus on what is to come, that Paul encourages us to adopt, so that we can trust in God in all circumstance, good and bad, because it is all a moment, passing in a breath before we stand in eternity before God.\n</p>\n<p>And it would be easy to say “well that’s that, I’m sorted”...\n</p>\n<p>But God also calls us to lead lives that are Spirit-led and Gods heart is not just to see us saved but to see as many as possible come to know him. He asks us to have a heavenly perspective that calls us to love others how he loves them.\n</p>\n<p>As most of us will be aware of, the well-known evangelist Billy Graham passed away this week, his widely publicised statement that “when you read that I have died, you should not believe it because I have simply changed address” has certainly appeared more than once in my social media feeds and articles I have read. It feels only right that in the week he died, that we should be reading about having a heavenly perspective, when this was how Billy Graham spent much of his time on earth.\n</p>\n<p>Mr Graham seems to have really grasped what Paul talks about in these letters, because he knew that just because his own destiny was assured, the work was not finished and God had more to do through him, by his spirit. Indeed, his heart was captured not by a selfish inward looking attitude, but on the desire to see the lost saved. He realised that even though he was already saved, that as many people as possible should have a chance to meet the same Jesus and to know the love, mercy and grace that comes from a relationship with God. Billy Graham wasn’t afraid of any perceptions of him, even when he confessed to getting things wrong, but he recognised these as fleeting troubles and did not let them obstruct his heavenly perspective, that the reason he was on earth at this time was so that he might boldly proclaim Jesus to all who would hear him.\n</p>\n<p>And this is the perspective we are all called to, everyday, to not look back at what could have been avoided or might have been, but to look forward into what we know is ahead.\n</p>\n<p>So the next time we feel called to despair or to lose hope, to be frustrated with earthly circumstances and troubles, it is my prayer that we will all remember Paul’s encouragements and remember to put whatever it is into perspective, because God loves us all in the here and now but there are even greater things yet to come!\n</p>\n<p>You can <a href=\"https://drive.google.com/file/d/1Ua9y69ZMKbbRwmjvh6Y-ouPEVLCYHmDN/view?usp=sharing\" target=\"_blank\">download a copy of the Reading Plan here</a>.<br>\n</p>\n<p>Photo by <a href=\"https://unsplash.com/photos/Nk5KAUgTpj4?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Samuel Ferrara</a> on <a href=\"https://unsplash.com/search/photos/heavenly?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a><span class=\"redactor-invisible-space\"><br></span>\n</p>",
  "colour": "purple",
  "date": "2018-02-26T11:55:00+00:00",
  "subtitle": "From January 1st through to Easter Sunday, we're inviting the church to read through the books of the New Testament together, following a plan that takes us chronologically through the Scriptures. Each week, we've invited a different person to reflect on what God has been saying to them through the readings of that week. This week, Ali Hogben shares his observations on week eight of our readings.",
  "title": "The importance of a heavenly perspective",
  "image": "/uploads/samuel-ferrara-503838-unsplash (Medium).jpg"
}