{
  "authors": [
    {
      "author": "wendy-neary"
    }
  ],
  "showOnPodcast": false,
  "itunesImage": "/uploads/logo.jpg",
  "deck": "<p>Reading the chapters set out for us this week, I have been struck by how radical Jesus is and how uncomfortable and difficult it must have been to be around him.\n</p>\n<p>His incredible miracles, his understanding of the needs of those who were looking for a shepherd and his ability to communicate the heart of his Father understandably earned him a large following.  However, his uncompromising words, strange parables and quite frankly swingeing insults (take a look at the 7 Woes) caused others to question and fall away or, if you were one of the ‘insulted’, to become his enemy.\n</p>\n<p>These chapters outline the time in Jesus ministry when he experienced mounting opposition.  However, he didn’t tone things down to make life easier for himself or for those who followed him.  He continued to speak the unpalatable truth and strongly challenge the hypocrisy of the Pharisees and Sadducees.\n</p>\n<p>The way he speaks at times is shocking and in this age of tolerance it would probably be deemed in a lot of Christian circles as ‘taking it just a bit too far’.  However, Jesus is unafraid of the prevailing atmosphere of the times.  Truth is truth is truth – and The Truth is what Jesus claimed to be.\n</p>\n<p>Even the Pharisees in seeking to trap him with difficult questions said: <i>\"We know that you are a man of integrity and that you teach the way of God in accordance with the truth.  <strong>You aren’t swayed by others and pay no attention to who they are.\"</strong></i> Matthew 22:16\n</p>\n<p>They saw that, unlike others, Jesus was not afraid of them, and did not seem to care what they thought of him.  He had one focus in his life and he never strayed from it.  Knowing the truth of who he was and the eternal importance of his mission, he had resolutely decided to shed all worries about what people might think.\n</p>\n<p>In contrast Peter’s story of denial is laid out in sad detail for us all to see.  At this point Peter certainly hadn’t learnt the art of not being swayed by others.  His fear overtook him and he denied that he even knew his friend and Lord.  He was swayed in the worst way possible.  However, this was not the end of the story for him.  Jesus had named him ‘the Rock’ and that was who he would become because of the love and forgiveness of his Lord.  His future was not defined by the failures of his past.\n</p>\n<p>Jesus’ call on our lives doesn’t change even if we bottle it when the chips are down.  He knows we won’t get it right all the time.  He forgives us when we are swayed and we lose our focus; but not only does He forgive, He then picks us up, steadies us, points our eyes in the right direction and entrusts us with a new role in His kingdom.  This amazing, uncompromising, radical Jesus chooses us to be his body here on earth.\n</p>\n<p>I do not feel worthy of this calling and I realise that I am so far from understanding this radical Jesus; but I want to have faith to say with Isaiah as he prophesied about Jesus:  <i>“Because the Sovereign Lord helps me I will not be disgraced.  Therefore have I set myself like flint and I know I will not be put to shame.”</i>  (Isaiah 50:7)\n</p>\n<p>You can <a href=\"https://drive.google.com/file/d/1Ua9y69ZMKbbRwmjvh6Y-ouPEVLCYHmDN/view?usp=sharing\" target=\"_blank\">download a copy of the Reading Plan here</a>.<br>\n</p>\n<p>Photo by <a href=\"https://unsplash.com/photos/v0PWN7Z38ag?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?hl=en-GB&amp;q=https://unsplash.com/photos/v0PWN7Z38ag?utm_source%3Dunsplash%26utm_medium%3Dreferral%26utm_content%3DcreditCopyText&amp;source=gmail&amp;ust=1517310106401000&amp;usg=AFQjCNGzkNgqGRZVinTDZLXXQzeb61xYSA\">Mads Schmidt Rasmussen</a> on <a href=\"https://unsplash.com/collections/1663391/my-first-collection/db687254e7b5528751610beffbe4e64a?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?hl=en-GB&amp;q=https://unsplash.com/collections/1663391/my-first-collection/db687254e7b5528751610beffbe4e64a?utm_source%3Dunsplash%26utm_medium%3Dreferral%26utm_content%3DcreditCopyText&amp;source=gmail&amp;ust=1517310106401000&amp;usg=AFQjCNE6Vd_lMW5cD7n58_kx-obRVeHFug\">Unsplash</a><span class=\"redactor-invisible-space\"><br></span>\n</p>",
  "colour": "purple",
  "date": "2018-01-29T11:03:00+00:00",
  "subtitle": "From January 1st through to Easter Sunday, we're inviting the church to read through the books of the New Testament together, following a plan that takes us chronologically through the Scriptures. Each week, we've invited a different person to reflect on what God has been saying to them through the readings of that week. This week, Wendy Neary shares her observations on the fourth week of readings.",
  "title": "The Radical Jesus",
  "image": "/uploads/radicaljesus1.jpg"
}