{
  "authors": [
    {
      "author": "caleb-ellwood"
    }
  ],
  "showOnPodcast": false,
  "itunesImage": "/uploads/logo.jpg",
  "deck": "<p>Hello. Hey. Hola. G'day. Alright. Hi. Good morning. Howdy. Buenas dias. Now then.\n</p>\n<p>We greet each other in all kinds of different ways.\n</p>\n<p>This week we've read through Paul's letters to the churches in Ephesus and Philippi, as well as letters he wrote to Timothy and Titus. In three of them, Paul greets the church or individual with the words \"grace and peace\". In fact, between them, Paul, Peter and John use the greeting in 16 of the books of the New Testament. We can assume that this was a very common way to greet people in the early church.\n</p>\n<p>\"Grace and peace from God the Father and Christ Jesus our Saviour.\" Titus 1:4<br>\n</p>\n<p>They're two great words - loaded with meaning. In many ways, they summarise the Gospel - the good news. Here's how scholars have defined and explained these two simple words...<br>\n</p>\n<p>Grace (charis in the original Greek language): of the merciful kindness by which God, exerting his holy influence upon souls, turns them to Christ, keeps, strengthens, increases them in Christian faith, knowledge, affection, and kindles them to the exercise of the Christian virtues.\n</p>\n<p>Peace (<em>eirēnē</em> in the original Greek language): security, safety, prosperity, felicity, (because peace and harmony make and keep things safe and prosperous). Of Christianity, the tranquil state of a soul assured of its salvation through Christ, and so fearing nothing from God and content with its earthly lot, of whatsoever sort that is.<br>\n</p>\n<p>So when Paul and others use \"grace and peace\" to greet those they're writing to, they're expressing all of the above. They're trying to encapsulate the merciful kindness, the assurance of salvation, the incredible grace and peace that is available to each and every person.\n</p>\n<p>That's what they're greeting with, what they're wishing and hoping and praying for, for their readers. If Paul were writing to you today, I'd like to think he would greet you with these words. I'd like to think he'd be willing you on to understand more of the grace and peace available to you, encouraging you to receive grace upon grace, peace upon peace.\n</p>\n<p>Maybe some of you today need to know more of the merciful kindness of God, maybe you need to experience more tranquillity of your soul, maybe you need to learn to be more content with your earthly lot. All of that is on offer. For you. Today.\n</p>\n<p>So come to him and receive in faith.\n</p>\n<p>And let's take Paul's lead in the way he greets others. Let's be people who wish more grace and more peace to those we encounter day by day, our colleagues, our friends, our neighbours. Let's allow our words and our actions to bring more grace and more peace to their lives.\n</p>\n<p>You can <a href=\"https://drive.google.com/file/d/1Ua9y69ZMKbbRwmjvh6Y-ouPEVLCYHmDN/view?usp=sharing\" target=\"_blank\">download a copy of the Reading Plan here</a>.<br>\n</p>\n<p>Photo by <a href=\"https://unsplash.com/photos/PUyuhpHr9Z4?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">rawpixel.com</a> on <a href=\"https://unsplash.com/search/photos/shaking-hands?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a>\n</p>",
  "colour": "purple",
  "date": "2018-03-12T14:35:00+00:00",
  "subtitle": "From January 1st through to Easter Sunday, we're inviting the church to read through the books of the New Testament together, following a plan that takes us chronologically through the Scriptures. Each week, we've invited a different person to reflect on what God has been saying to them through the readings of that week. This week, Caleb Ellwood shares his observations on week ten of our readings.",
  "title": "What's in a greeting?",
  "image": "/uploads/rawpixel-com-552390-unsplash (Medium).jpg"
}