{
  "authors": [
    {
      "author": "caleb-ellwood"
    }
  ],
  "showOnPodcast": false,
  "itunesImage": "/uploads/logo.jpg",
  "deck": "<p>A few months back I preached a sermon about the book of Psalms in the Bible. I made a passing remark about something which since then has stuck with me and continues to challenge me today.\n</p>\n<p>Psalms 120-134 are commonly known as the Songs (or Psalms) of Ascent. It is widely believed that these songs were collated together for a particular use. There are a number of schools of thought on what exactly this particular use was, but one suggestion is that they were songs to be sung as the Jewish people travelled to the temple in Jerusalem three times each year for the major feasts/festivals. Jerusalem is on a hilltop, so these would be sung as they ascended towards the city.\n</p>\n<p>I love that image of groups of people worshipping together on their journey to the temple. People would be travelling in from every direction, from their homes around the nation towards the capital city. And on the road they would sing together these songs. There is a building, a crescendo to these songs. It's a way of preparing and focussing hearts and minds before they gather in the temple.\n</p>\n<p>The reason this challenges me is that I have found that I often only really prepare my heart for a Sunday service if I have a role to play - if I'm preaching or leading a meeting or running a youth group. On a Sunday when I don't have a specified role I can sometimes turn up having never prepared or focussed my heart and mind.\n</p>\n<p>I'm trying to change this and every Sunday trying to set aside some time to prepare my heart and listen to God. It's an unhelpful state of mind to turn up believing that I don't have a role to play if I'm not on a rota. Whenever we worship together we're all participants, we all have a role. God may prompt me to bring something to the meeting, a word, an encouragement. He may want me to share this from the front or he may want me to share this with an individual.\n</p>\n<p>And there's just something powerful about coming to a church service with my heart ready to worship. When I preached that sermon about the Psalms I remember asking the question \"What songs do you sing on the way to church?\"\n</p>\n<p>We can choose to come to church unprepared and hope that others will lead us into a place of worship, or we can prepare our hearts before the service so when we gather we are ready to praise and worship him.\n</p>\n<p>It could be a few minutes reading the Bible on a Sunday morning, or it could be as simple as listening to a worship song as we get ready or travel to church.\n</p>\n<p>The question is this... What songs will you sing on the way to church? How will you prepare your heart before coming to worship with others on a Sunday morning?\n</p>",
  "colour": "purple",
  "subtitle": "Caleb challenges us to think about what we do in preparation for our Sunday worship gatherings.",
  "title": "What songs do you sing on your way to church?",
  "image": "/uploads/IMG_0064 (Large).jpg"
}